content/posts/Intrinsic_and_extrinsic_thermodynamics_for_stochastic_population_processes_with_multi-level_large-deviation_structure_by_Eric_Smith_in_2020.md
+++
title = "Intrinsic and extrinsic thermodynamics for stochastic population processes with multi-level large-deviation structure by Eric Smith in 2020"
author = ["Cameron Smith"]
lastmod = 2020-09-20T17:34:46-04:00
slug = "Intrinsic_and_extrinsic_thermodynamics_for_stochastic_population_processes_with_multi-level_large-deviation_structure_by_Eric_Smith_in_2020"
draft = false
+++

## [papers]({{< relref "papers" >}}), [stochastic processes]({{< relref "stochastic_processes" >}}), [large deviations]({{< relref "large_deviations" >}}), [hierarchical modularity]({{< relref "hierarchical_modularity" >}}) {#papers--papers-dot-md--stochastic-processes--stochastic-processes-dot-md--large-deviations--large-deviations-dot-md--hierarchical-modularity--hierarchical-modularity-dot-md}


## contents {#contents}


### I. Introduction {#i-dot-introduction}

<!--list-separator-->

-  1. Main results and order of the derivation


### II. Multi-level systems {#ii-dot-multi-level-systems}

<!--list-separator-->

-  1. Micro to macro, within and between levels

    <!--list-separator-->

    -  A. Models based on population processes

        <!--list-separator-->

        -  a. The multiscale distribution

        <!--list-separator-->

        -  b. Fast relaxation to fixed points at the microscale

        <!--list-separator-->

        -  c. Elementary transitions in the mesoscale

        <!--list-separator-->

        -  d. Thermalization in the microscale

        <!--list-separator-->

        -  e. A system/environment partition within the mesoscale

        <!--list-separator-->

        -  f. Marginal and conditional distributions in system and environment

        <!--list-separator-->

        -  g. Notations involving pairs of indices

    <!--list-separator-->

    -  B. Stochastic description within the mesoscale

        <!--list-separator-->

        -  a. The marginal stochastic process on s

        <!--list-separator-->

        -  b. Time-independent overall stationary distribution as a reference

        <!--list-separator-->

        -  c. Detailed balance propagating up from the microscale

    <!--list-separator-->

    -  C. System-environment decompositions of the entropy change

        <!--list-separator-->

        -  1. The information/heat decomposition of total relative-entropy change

        <!--list-separator-->

        -  2. Relative entropy referencing the system steady state at instantaneous parameters

        <!--list-separator-->

        -  3. Intrinsic and extrinsic thermodynamics

        <!--list-separator-->

        -  4. System Hartley information as a temporal connection


### III. Hamilton-Jacobi theory for large deviations {#iii-dot-hamilton-jacobi-theory-for-large-deviations}

<!--list-separator-->

-  A. Generating functions, Liouville equation, and the Hamilton-Jacobi construction for saddle points

    <!--list-separator-->

    -  1. Relation of the Liouville operator to the cumulant-generating function

        <!--list-separator-->

        -  a. From coherent-state to number-potential coordinates

    <!--list-separator-->

    -  2. Legendre transform of the CGF

    <!--list-separator-->

    -  3. Hamiltonian equations of motion and the action

        <!--list-separator-->

        -  a. Circulation-free vector-field of \\[\theta\\] for the stationary distribution

<!--list-separator-->

-  B. The stationary distribution and macrostates

    <!--list-separator-->

    -  1. Coherent states, dimensional reduction, and the \\[f\\]-divergence

    <!--list-separator-->

    -  2. Multiple fixed points and instantons


### IV. Population processes with CRN-form generators {#iv-dot-population-processes-with-crn-form-generators}

<!--list-separator-->

-  A. Hypergraph generator of state-space transitions

    <!--list-separator-->

    -  1. Descaling of transition matrices for microstates

    <!--list-separator-->

    -  2. Descaling of transition matrices for macrostates

    <!--list-separator-->

    -  3. Equations of motion and the L=0 manifold

    <!--list-separator-->

    -  4. The Schlögl cubic model to illustrate

<!--list-separator-->

-  B. Large-deviation and Lyapunov roles of the effective action

    <!--list-separator-->

    -  1. Convexity proof of the Lyapunov property of macrostate entropy in Hamilton-Jacobi variables

    <!--list-separator-->

    -  2. Instantons and the loss of Large-deviation accessibility from first passages


### V. Cycle decompositions and non-decrease of intrinsic and extrinsic relative entropies {#v-dot-cycle-decompositions-and-non-decrease-of-intrinsic-and-extrinsic-relative-entropies}

<!--list-separator-->

-  A. Complexity classes and cycle decompositions of stationary currents on the hypergraph

    <!--list-separator-->

    -  1. Complex balance and relations of the Lyapunov and large-deviation roles of \\[S\_{\mathrm{eff}}\\]

        <!--list-separator-->

        -  a. Finite cycle decomposition of the steady state current

        <!--list-separator-->

        -  b. Locally linear coordinates for classical entropy change in complex-balanced CRNs

    <!--list-separator-->

    -  2. Vorticity in the flowfield of stationary trajectories

    <!--list-separator-->

    -  3. Hyperflow decomposition for non-complex-balanced CRNs

<!--list-separator-->

-  B. Cycle decomposition in the microstate space, and non-decrease of relative entropy components

    <!--list-separator-->

    -  1. The system-marginal relative entropy from \\[\bar{\rho}^s\\]

    <!--list-separator-->

    -  2. Non-negativity of the housekeeping entropy rate


### VI. Examples {#vi-dot-examples}

<!--list-separator-->

-  A. Dualizing the housekeeping embedding thermodynamics

    <!--list-separator-->

    -  1. One system, families of environments

        <!--list-separator-->

        -  a. elementary reactions

        <!--list-separator-->

        -
